ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0l111x/DMA_1.0.xml
        <register id="DMA_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="DMACH0" description="DMA Channel 0 interrupt signals that size counter reached zero (DMASZ=0)." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur or is masked out"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="DMACH1" description="DMA Channel 1 interrupt signals that size counter reached zero (DMASZ=0)." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur or is masked out"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="DMACH2" description="DMA Channel 2 interrupt signals that size counter reached zero (DMASZ=0)." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur or is masked out"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="PREIRQCH0" description="Pre-IRQ for Channel 0. Size counter reached Pre-IRQ threshold." begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
            <bitfield id="ADDRERR" description="DMA address error, SRC address not reachable." begin="24" end="24" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
            <bitfield id="DATAERR" description="DMA data error, SRC data might be corrupted (PAR or ECC error)." begin="25" end="25" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
        </register>
        <register id="DMA_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="DMACH0" description="DMA Channel 0 interrupt signals that size counter reached zero (DMASZ=0)." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set interrupt"/>
            </bitfield>
            <bitfield id="DMACH1" description="DMA Channel 1 interrupt signals that size counter reached zero (DMASZ=0)." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set interrupt"/>
            </bitfield>
            <bitfield id="DMACH2" description="DMA Channel 2 interrupt signals that size counter reached zero (DMASZ=0)." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set interrupt"/>
            </bitfield>
            <bitfield id="PREIRQCH0" description="Pre-IRQ for Channel 0. Size counter reached Pre-IRQ threshold." begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
            <bitfield id="ADDRERR" description="DMA address error, SRC address not reachable." begin="24" end="24" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
            <bitfield id="DATAERR" description="DMA data error, SRC data might be corrupted (PAR or ECC error)." begin="25" end="25" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
        </register>
        <register id="DMA_ICLR" width="32" offset="0x28" description="Interrupt clear">
            <bitfield id="DMACH0" description="DMA Channel 0 interrupt signals that size counter reached zero (DMASZ=0)." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear interrupt"/>
            </bitfield>
            <bitfield id="DMACH1" description="DMA Channel 1 interrupt signals that size counter reached zero (DMASZ=0)." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear interrupt"/>
            </bitfield>
            <bitfield id="DMACH2" description="DMA Channel 2 interrupt signals that size counter reached zero (DMASZ=0)." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear interrupt"/>
            </bitfield>
            <bitfield id="PREIRQCH0" description="Pre-IRQ for Channel 0. Size counter reached Pre-IRQ threshold." begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
            <bitfield id="ADDRERR" description="DMA address error, SRC address not reachable." begin="24" end="24" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
            <bitfield id="DATAERR" description="DMA data error, SRC data might be corrupted (PAR or ECC error)." begin="25" end="25" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
        </register>
