ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0l111x/DMA_1.0.xml
Note: This register is only available in a FULL-channel configuration. Please consult the datasheet of the specific device to map which channel number has FULL or BASIC capability. In a BASIC configuration this register is a read only value and always reads as 0x0." begin="6" end="4" width="3" rwaccess="R/W">
                <bitenum id="PREIRQ_DISABLE" value="0x0" description="Pre-IRQ event disabled."/>
                <bitenum id="PREIRQ_1" value="0x1" description="Issure Pre-IRQ event when DMASZ=1"/>
                <bitenum id="PREIRQ_2" value="0x2" description="Issure Pre-IRQ event when DMASZ=2"/>
                <bitenum id="PREIRQ_4" value="0x3" description="Issure Pre-IRQ event when DMASZ=4"/>
                <bitenum id="PREIRQ_8" value="0x4" description="Issure Pre-IRQ event when DMASZ=8"/>
                <bitenum id="PREIRQ_32" value="0x5" description="Issure Pre-IRQ event when DMASZ=32"/>
                <bitenum id="PREIRQ_64" value="0x6" description="Issure Pre-IRQ event when DMASZ=64"/>
                <bitenum id="PREIRQ_HALF" value="0x7" description="Issure Pre-IRQ event when DMASZ reached the half size point of the original transfer size"/>
            </bitfield>
        </register>
        <register id="DMA_DMASA" width="32" offset="0x4" description="DMA Channel Source Address">
            <bitfield id="ADDR" description="DMA Channel Source Address" begin="31" end="0" width="32" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Highest possible value"/>
            </bitfield>
        </register>
        <register id="DMA_DMADA" width="32" offset="0x8" description="DMA Channel Destination Address">
            <bitfield id="ADDR" description="DMA Channel Destination Address" begin="31" end="0" width="32" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Highest possible value"/>
            </bitfield>
        </register>
        <register id="DMA_DMASZ" width="32" offset="0xC" description="DMA Channel Size">
            <bitfield id="SIZE" description="DMA Channel Size in number of transfers" begin="15" end="0" width="16" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="MAXIMUM" value="0xFFFF" description="Highest possible value"/>
            </bitfield>
        </register>
        </group>

</module>